app/controllers/api/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    render json: { animals: Animal.all }